using System.Data.SqlClient;
using System.Data;
using System.Linq;
using System.Text;
// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
// connect to sql DB
// https://generator-online.com/uk/names/
Console.OutputEncoding = Encoding.UTF8;
var man_name_base = "Харчук Живосил Жданович,Стефанівський Дмитро Остапович,Дрозденко Юліан Соломонович,Михайлик Надій Найденович,Магера Мусій Юхимович,Мишковський Едуард Златович,Сидор Чесмил Ростиславович,Архимович Воля Мстиславович,Аверченко Судивой Левович,Гаврюшенко Йомер Остапович,Ярославський Житомир Олегович,Пащук Ярош Соломонович,Полотай Сокіл Вадимович,Безпельченко Флор Соломонович,Пироженко Жадан Полянович,Цимбалістий Щастислав Артемович,Ілінський Щедрогост Адріанович,Лебединець Йосип Соломонович,Троцюк Вітрян Найденович,Плішка Боримисл Адамович".Split(',').ToList();
var woman_name_base = "Пінчук Жозефіна Омелянівна,Рафальська Ладомила Герасимівна,Милорадович Леся Семенівна,Олексієнко Жанна Зорянівна,Зайчук Корнелія Костянтинівна,Пилипчак Наталя Соломонівна,Гук Улита Августинівна,Досенко Михайлина Володимирівна,Шморгун Пелагея Леонідівна,Омелян Дарина Ростиславівна,Крамськой Земфіра Арсенівна,Петриченко Цвітана Фролівна,Карпенко Берта Адріанівна,Гриневецька Тіна Любомирівна,Жежер Твердогоста Антонівна,Ластовецька Чеслава Орестівна,Климишин Богуслава Сарматівна,Корбут Есфір Жданівна,Шульга Донна Захарівна,Улинець Дана Романівна".Split(',').ToList();
var adresses = "1267, Житомирська область, місто Житомир, пров. Артема, 78;13290, Тернопільська область, місто Тернопіль, просп. Різницька, 31;27951, Луганська область, місто Луганськ, вул. П. Орлика, 94;04398, Чернівецька область, місто Чернівці, пров. М. Коцюбинського, 37;13448, Миколаївська область, місто Миколаїв, пров. М. Коцюбинського, 42;93250, Запорізька область, місто Запоріжжя, вул. І. Франкa, 11;08589, Запорізька область, місто Запоріжжя, пров. Солом’янська, 40;25449, Житомирська область, місто Житомир, пл. Прорізна, 06;55878, Волинська область, місто Луцьк, пров. Б. Грінченка, 29;92412, Одеська область, місто Одеса, пл. Пирогова, 23;07794, Закарпатська область, місто Ужгород, вул. Тараса Шевченка, 74;66293, Полтавська область, місто Полтава, вул. Арсенальна, 28;51899, Київська область, місто Київ, пров. Михайла Грушевського, 29;05300, Дніпропетровська область, місто Дніпро, пл. Шота Руставелі, 75;01261, Львівська область, місто Львів, вул. Урицького, 38;96900, Івано-Франківська область, місто Івано-Франківськ, пров. Хрещатик, 02;50305, Кіровоградська область, місто Кропивницький, просп. Б. Грінченка, 96;71037, Донецька область, місто Донецьк, просп. Урицького, 70;73129, Миколаївська область, місто Миколаїв, просп. Михайла Грушевського, 48;78482, Тернопільська область, місто Тернопіль, просп. Пирогова, 43;68861, Чернігівська область, місто Чернігів, вул. Урицького, 92;24623, Кіровоградська область, місто Кропивницький, пл. Мельникова, 28;47259, Харківська область, місто Харків, просп. Фізкультури, 90;31933, Черкаська область, місто Черкаси, пл. Шота Руставелі, 12;38852, Кіровоградська область, місто Кропивницький, пров. Арсенальна, 19;97217, Волинська область, місто Луцьк, пров. Б. Грінченка, 86;65381, Полтавська область, місто Полтава, просп. Лук’янівська, 68;68856, Закарпатська область, місто Ужгород, пл. П. Орлика, 96;58754, Запорізька область, місто Запоріжжя, вул. П. Орлика, 47;09221, Львівська область, місто Львів, пров. І. Франкa, 16;82936, Полтавська область, місто Полтава, пров. Урицького, 66;31907, Львівська область, місто Львів, просп. Тараса Шевченка, 62;10897, Черкаська область, місто Черкаси, вул. І. Франкa, 33;15346, Черкаська область, місто Черкаси, пров. Хрещатик, 48;48856, Миколаївська область, місто Миколаїв, пров. Фізкультури, 43;44639, Чернігівська область, місто Чернігів, пл. І. Франкa, 11;71061, Житомирська область, місто Житомир, вул. І. Франкa, 92;22574, Полтавська область, місто Полтава, пров. Михайла Грушевського, 48;36762, Закарпатська область, місто Ужгород, пров. П. Орлика, 76".Split(';');
var rnd = new Random();
var sqlConnect = new SqlConnection("Data Source=DESKTOP-52QTNQ9;Initial Catalog=MY_DB;Integrated Security=true;");
var date = new DateTime(2010,1,1);
var typee = new string[] { "Зіткнення","Перекидання","Падіння у воду","Пожежа в автомобілі","Наїзд на пішохода" };
var status = new string[] { "В обробці","Відхилена","Прийнята" };
var pidozra = new string[] { "Винуватець","Потерпілий","Підозрюваний","Свідок"};
sqlConnect.Open();
try
{
    (new SqlCommand($"DELETE FROM PeopleTable;", sqlConnect)).ExecuteNonQuery();
    for (int i = 0; i < 20; i++)
    {
        var name = man_name_base[i].Split(' '); 
        (new SqlCommand($"INSERT INTO PeopleTable VALUES ({i + 1},N'{name[1]}',N'{name[0]}',N'{name[2]}',N'{adresses[i]}',{rnd.Next(5)});", sqlConnect)).ExecuteNonQuery();
    }
    for (int i = 0; i < 20; i++)
    {
        var name = woman_name_base[i].Split(' ');
        (new SqlCommand($"INSERT INTO PeopleTable VALUES ({i + 21},N'{name[1]}',N'{name[0]}',N'{name[2]}',N'{adresses[19 + i]}',{rnd.Next(5)});", sqlConnect)).ExecuteNonQuery();
    }
    (new SqlCommand($"DELETE FROM EventTable;", sqlConnect)).ExecuteNonQuery();
    
    (new SqlCommand($"SET IDENTITY_INSERT EventTable ON", sqlConnect)).ExecuteNonQuery();
    for (int i = 0; i < 20; i++)
    {
        date = date.AddDays(rnd.Next(1, 365));
        var t = rnd.Next(6);
        if(t>=2)
        (new SqlCommand($"INSERT INTO EventTable ([NUM], [DATE], [TYPE], [STATUS], [DOC_NUM], [TERITORIA]) VALUES ({i + 1},'{date.ToString("yyyy-MM-dd")}',N'{typee[rnd.Next(4)]}',N'{status[2]}',{rnd.Next(2345676)},N'{adresses[rnd.Next(39)]}');", sqlConnect)).ExecuteNonQuery();
        else
            (new SqlCommand($"INSERT INTO EventTable ([NUM], [DATE], [TYPE], [STATUS], [DOC_NUM], [TERITORIA]) VALUES ({i + 1},'{date.ToString("yyyy-MM-dd")}',N'{typee[rnd.Next(4)]}',N'{status[t]}',NULL,NULL);", sqlConnect)).ExecuteNonQuery();
    }
    (new SqlCommand($"DELETE FROM SuspicionTable;", sqlConnect)).ExecuteNonQuery();
    for(int i = 0; i < 30; i++)
    { 
        (new SqlCommand($"INSERT INTO SuspicionTable VALUES ({rnd.Next(1,21)},{rnd.Next(1,41)},N'{pidozra[rnd.Next(4)]}');", sqlConnect)).ExecuteNonQuery();
    }
}
catch (Exception ex)
{
    Console.WriteLine(ex.Message);
}
sqlConnect.Close();